otvet = dict()
telefon = dict()

otvet['🌀VisitBasis']       = (

'✅*Когда заполняется отчет по продажам в VisitBasis?\n\n*'
   '  - Каждый день, в конце рабочего дня\n\n'

'✅*Находясь где, промоутер должен фиксировать в VisitBasis начало рабочего дня?\n\n*'
   '  - В торговом зале в форме\n\n'

'✅*В какой момент необходимо закрывать визит в VisitBasis?\n\n*'
   '  - Сразу после окончания смены, когда выполнены все задачи\n\n'

'✅*Сколько задач в программе VisitBasis необходимо выполнить за день?\n\n*'
   '  - 2\n\n'

'✅*Куда промоутеру обратиться, если возникают сложности с работой c VisitBasis?\n*'
'*(несколько верных ответов)\n\n*'
   '  - "Обратиться к представителю Ventra,\n'
   '  - Сделать запрос на почту Visitbasis@ventra.biz"\n\n'

'✅*В какой момент необходимо провести первую синхронизацию в программе VisitBasis?\n\n*'
   '  - Сразу в начале смены, после селфи-прихода\n\n'

'✅*Что делать если после завершения вчерашней смены промоутера, были продажи смартфонов ОРРО?\n\n*'
   '  - Добавить эти продажи в отчет текущего дня\n\n'

'✅*Как получить логин и пароль для работы в программе VentraPortal?\n\n*'
   '  - Пароль приходит на почту в течение 3 дней с момента трудоустройства\n\n'

'✅*За сколько дней до отпуска необходимо подать заявление?\n\n*'
   '  - 14\n\n'

'✅*Как промоутеры подать заявление на отпуск?\n*'
'*(несколько верных ответов)*\n\n'
   '  - "Создать заявку на отпуск в VentraPortal в разделе ""Отпуска"",\n'
   '  - Распечатать и подписать заявление на отпуск,\n'
   '  - Долждаться согласования заявки руковдителем (супервайзером)"\n\n'

'✅*Как промотуер может посмотреть свой расчетный листок в программе VentraPortal?\n\n*'
   '  - На портале в разделе "Расчетные листы"\n\n'

'✅*Когда выгружаются расчетные листы в программе VentraPortal?\n\n*'
   '  - Раз в месяц 10 числа\n\n'

'✅*Каким образом промоутер может возместить расходы в случае командировок или иной служебной необходимости?\n*'
'*(Несколько верных ответов)\n\n*'
   '  - "Необходимо подать заявку на VentraPortal в блоке "Возмещение расходов",\n'
   '  - Распечатать и подписать на VentraPortal авансовый отчет,\n'
   '  - Отправить через курьева оригиналы чеков и пописанный авансовый отчет в Ventra"\n\n'

'✅*Что необходимо сделать, чтобы получить возмещение по затратам медкнижку?\n*'
'*(несколько верных ответов)\n\n*'
   '  - "Необходимо сформировать заявку на Ventra Portal,\n'
   '  - Необходимо распечатать и пописать авансовый отчет,\n'
   '  - Отправить подписанный авансовый отчет вместе с оригиналам чеков в Ventra"\n\n'

'✅*Промоутеру необходимо отправить документы по мед. книжке в офис Ventra.\n*'
'*Каким образом он может заказать курьера?\n\n*'
   '  - Создать заявку на VentraPortal в разделе "Возмещение расходов"\n\n'

'✅*Что необходимо сделать промоутеру после выхода с больничного?\n*'
'*(несколько верных ответов)\n\n*'
   '  - "Подать заявку на закрытие больничного листа на портале Ventra,\n'
   '  - Передать оригинал больничного личта в офис Ventra"\n\n'

'✅*Когда промоутер может получить оплату больничного листа?\n\n*'
   '  - В течение 3 рабочих дней после предоставления оригинала больничного листа в Ventra\n\n'

'✅*В какой момент необходимо сделать "селфи уход" в VisitBasis?\n\n*'
   '  - Сразу после окончания времени смены\n\n'

'✅*Когда необходимо начать использование программы VisitBasis?\n\n*'
   '  - С первого рабочего дня\n\n'
                             )
telefon['A1k']              = (



'✅*Характеристики процессора модели OPPO A1k: \n(Несколько вариантов ответа)\n\n*'
   '  - "MediaTek MT6762R P22,\n'
   '  - 12 нм,\n'
   '  - 8 ядер\n\n'

'✅*Отметьте отличия модели OPPO A1k  от модели А5s\n'
'(Несколько вариантов ответа)*\n\n'
   '  - Размер экрана\n'
   '  - Модификация процессора\n'
   '  - Емкость аккумулятора\n\n'

'✅*Отметьте преимущества модели OPPO A1k перед моделью Huawei Y6 2019*\n\n'
   '  - Больше емкость аккумулятора у модели OPPO A1k,\n'
   '  - Наличие чехла в комплекте только у модели OPPO A1k"\n\n'

'✅*Отметьте преимущества модели OPPO A1k перед моделью Honor 8A*\n\n'
   '  - Больше емкость аккумулятора у модели OPPO A1k,\n'
   '  - Наличие чехла в комплекте только у модели OPPO A1k"\n\n'
                             )
telefon['A5s']              = (


'✅*Отметьте преимущества модели OPPO A5s перед моделью Samsung Galaxy A10 \n(несколько вариантов ответа)\n\n*'
   '  - "Больше емкость аккумулятора у модели OPPO A5s,\n'
   '  - Большая тактовая частота процессора у модели OPPO A5s,\n'
   '  - Больше объем оперативной памяти у модели OPPO A5s"\n\n'

'✅*Отметьте верную модель процессора смартфона OPPO A5s\n\n*'
   '  - MediaTek MT6765 P35\n\n'

'✅*Отметьте отличия модели OPPO A1k  от модели А5s\n'
'(Несколько вариантов ответа)*\n\n'
   '  -Размер экрана\n'
   '  -Модификация процессора\n'
   '  -Емкость аккумулятора\n\n'

'✅*Отметьте преимущества модели OPPO A5s перед моделью Huawei Y7\n'
'(несколько вариантов ответа)*\n\n'
   '  -Наличие чехла в комплекте только у модели OPPO A5s,\n'
   '  -Большая тактовая частота процессора у модели OPPO A5s\n'
                             )
otvet['A5 2020']          = (


'✅*Клиент увидел Samsung Galaxy A20s и хочет купить его, так как считает \nоптимальным по характерстикам. На основании каких преимуществ вы \nможете переориентировать его на OPPO A5 2020? \nНесколько верных вариантов\n\n*'
   '  - "Более новая модификация процессора - мощность и скорость выше, энергопотребление ниже,\n'
   '  - Больше емкость аккумулятора и возможность обратной зарядки - заряжать устройство можно реже,\n'
   '  - Наличие NFC модуля - удобно и надежно"\n\n'


'✅*Съемка видео высокой четкости со стабилизацией на \nмоделях OPPO A5 2020 и OPPO A9 2020 достигается за счет:*\n\n'
   '  -Гироскопа и электронной стабилизации\n\n'

'✅*Модификация процессора моделей OPPO A5 2020 и OPPO A9 2020:*\n\n'
   '  -Snapdragon 665\n\n'

'✅*Разрешение фронтальной камеры модели OPPO А5 2020*\n\n'
   '  -8 Мп\n\n'

'✅*Отметьте ОТЛИЧИЯ модели OPPO A5 2020 и OPPO A9 2020 \n(несколько верных ответов)*\n\n'
   '  -Цветовая линейка,\n'
   '  -Объем встроенной и оперативной памяти,\n'
   '  -Разрешение основного модуля задней камеры\n\n'

'✅*Сколько портретных режимов включает модель OPPO A5 2020*\n\n'
   '  -7 на основной камере и 5 на фронтальной\n\n'

'✅*Может ли клиент снимать видео с широким углом на основную камеру модели OPPO A5 2020?*\n\n'
   '  -Нет\n\n'
'✅*Какая скорость срабатывания функции "Распознавание лица" на модели OPPO A5 2020?*\n\n'
   '  -0,08 секунды\n\n'

'✅*Какие режимы звучания Dolby Atmos предусмотрены в смартфонах OPPO A5 2020 и A9 2020?\n'
'(4 варианта ответа)*\n\n'
   '  -Динамичный,\n'
   '  -Фильмы,\n'
   '  -Игра,\n'
   '  -Музыка\n\n'

'✅*В каких режимах клиент может активировать Удобную Кнопку на модели OPPO A5 2020?\n'
'(2 верных ответа)*\n\n'
   '  -Управление с помощью жестов,\n'
   '  -Меню касаний\n\n'
'✅*Какая версия ColorOS установлена на модели OPPO A5 2020?*\n\n'
   '  -6.0(6.0.1)\n\n'

'✅*Каким образом клиент может активировать режим "Умная езда" ("Умное вождение") на модели OPPO А5 2020?*\n\n'
   '  -Настройки - Умные сервисы - Умное вождение\n\n'

'✅*В чем преимущества основной камеры с четырьмя объективами смартфона OPPO А5 2020?\n'
'Несколько верных ответов*\n\n'
   '  -Широкоугольный объектив 119 градусов: в кадр войдет все,\n'
   '  -Два отдельных модуля для съемки особенных портретов,\n'
   '  -12 Мп + Диафрагма f 1.8 с высокой чувствительностью для отличного качества снимков в любых условиях освещения\n\n'

'✅*В каких режимах видео работает стабилизация на модели OPPO A5 2020?\n'
'Несколько верных ответов*\n\n'
   '  -1080Р\n'
   '  -720Р\n \n'
'✅*При каких условиях со смартфона OPPO A5 2020 можно раздавать заряд?*\n\n'
   '  -Если в OPPO A5 2020 активирован режим OTG\n\n'

'✅*Отметьте основные преимущества OPPO A5 2020.\n'
'Несколько верных ответов*\n\n'
   '  -4 модуля основной камеры, стабилизация видео и встроенные кинематографические эффекты,\n'
   '  -Аккумулятор 5000 мАч с возможностью обратной зарядки,\n'
   '  -Звук Dolby Atmos и высокая прочность устройства\n\n'

'✅*Клиент слышал о смартфоне Huawei P smart Z. \n'
'На основании каких преимуществ вы можете переориентировать его на OPPO A5 2020?\n'
'Несколько верных вариантов*\n\n'
   '  -4 модуля основной камеры против двух. Наличие широкоугольного объектива,\n'
   '  -Больше емкость аккумулятора и возможность обратной зарядки - заряжать устройство можно реже,\n'
   '  -Звук Dolby Atmos - мини-кинотеатр в кармане клиента\n\n'

'✅*Клиент увидел рекламу Vivo Y11 и спрашивает о нем. \n'
'На основании каких преимуществ вы можете переориентировать его на OPPO A5 2020?\n'
'Несколько верных вариантов*\n\n'
   '  -Более новая модификация процессора - мощность и скорость выше, энергопотребление ниже,\n'
   '  -Наличие NFC модуля - удобно и надежно,\n'
   '  -Больше объем встроенной памяти - больше фильмов, музыки и видео без переноса на внешние носители\n\n'

'✅*Клиент увидел Samsung Galaxy A30s (3+32) и хочет купить его, так как считает оптимальным по характеристикам.\n'
'На основании каких преимуществ вы можете переориентировать его на OPPO A5 2020?\n'
'Несколько верных вариантов*\n\n'
   '  -4 модуля основной камеры против трех - больше возможностей для съемки,\n'
   '  -Больше емкость аккумулятора и возможность обратной зарядки - заряжать устройство можно реже\n\n'

'✅*Каким образом клиент может активировать режим "Умная езда" ("Умное вождение") на модели OPPO А5 2020?*\n\n'
   '  -Настройки - Умные сервисы - Умное вождение\n\n'
                             )
otvet['A9 2020']          = (

'✅*Отметьте преимущества модели OPPO A9 2020 перед моделью Samsung Galaxy A51 (4+64 Гб)*\n\n'
   '  - Больше емкость аккумулятора у модели OPPO A9 2020,\n'
   '  - Больше объем встроенной памяти у модели OPPO A9 2020"\n\n'

'✅*Отметьте преимущества модели OPPO A9 2020 перед моделью Honor 20 lite*\n\n'
   '  - Больше емкость аккумулятора у модели OPPO A9 2020,\n'
   '  - Четыре модуля камеры у OPPO A9 2020 против трех у Honor 20 lite\n\n'

'✅*Отметьте преимущества модели OPPO A9 2020 перед моделью Realme 5Pro*\n\n'
   '  - Больше емкость аккумулятора у модели OPPO A9 2020,\n'
   '  - Наличие NFC тоолько у модели OPPO A9 2020,\n'
   '  - Звук Dolby Atmos только у модели OPPO A9 2020\n\n'

'✅*Какие технологии включает режим Ultra Night 2.0 на модели OPPO A9 2020? \n(несколько вариантов ответа)*\n\n'
   '  - Режим многокадрового шумоподавления,\n'
   '  - Технология объединения пикселя 4-в-1\n\n'
'✅*Съемка видео высокой четкости со стабилизацией на моделях OPPO A5 2020 и OPPO A9 2020 достигается за счет:*\n\n'
   '  - Гироскопа и электронной стабилизации\n\n'

'✅*Модификация процессора моделей OPPO A5 2020 и OPPO A9 2020:*\n\n'
   '  - Snapdragon 665\n\n'

'✅*Разрешение фронтальной камеры модели OPPO А9 2020*\n\n'
   '  - 16 Мп\n\n'

'✅*Отметьте ОТЛИЧИЯ модели OPPO A5 2020 и OPPO A9 2020 \n(несколько верных ответов)*\n\n'
   '  - Цветовая линейка,\n'
   '  - Объем встроенной и оперативной памяти,\n'
   '  - Разрешение основного модуля задней камеры\n\n'

'✅*Какие режимы звучания Dolby Atmos предусмотрены в смартфонах OPPO A5 2020 и A9 2020?\n'
'(4 варианта ответа)*\n\n'
   '  - Динамичный,\n'
   '  - Фильмы,\n'
   '  - Игра,\n'
   '  - Музыка\n\n'
'✅*На модели OPPO А9 2020 установлена система ColorOS на базе:*\n\n'
   '  - Androind 9.0\n\n'
                             )

otvet['A31']              = (

'✅*Как происходит макросъемка в ОРРО А31?\n\n*'
   '  - На макромодуль\n\n'

'✅*В каких цветах представлена модель ОРРО А31?\n\n*'
   '  - Зеленый, Белый, Черный\n\n'

'✅*Сколько времени занимает разблокировка смартфона сканером отпечатка пальца\n*'
'*на модели OPPO A31? Отметьте характеристику\n\n*'
   '  - 0.47с при выключенном экране и 0.36 при активном\n\n'

'✅*Какой процессор установлен в ОРРО А31? Отметьте характеристику\n\n*'
   '  - MTK Helio P35\n\n'

'✅*Какой стандарт оперативной памяти установлен в ОРРО А31? Отметьте характеристику\n\n*'
   '  - LPDDR 4X\n\n'

'✅*Какой объем внутреннего хранилища у модели ОРРО А31?\n\n*'
   '  - 64 Гб\n\n'

'✅*Kакая диагональ и разрешение у экрана ОРРО А31?\n\n*'
   '  - 6,5" HD+\n\n'

'✅*Как работает технология защиты глаз экрана в модели ОРРО А31?\n\n*'
   '  - Фильтрует вредный синий свет, испускаемый ЖК матрицами\n\n'

'✅*Каково фокусное расстояние макромодуля ОРРО А31?\n\n*'
   '  - 40 мм\n\n'

'✅*Какой слот расширения установлен в ОРРО А31?\n\n*'
   '  - Тройной - 2 Sim-карты и карта памяти\n\n'

'✅*Какой объем аккумуляторной батареи установлен в ОРРО А31?\n\n*'
   '  - 4230 мАч\n\n'

'✅*Режим DazzleColor в ОРРО А31 это:\n\n*'
   '  - Продвинутый алгоритм, улучшающий цветопередачу на фотографиях\n\n'

'✅*Что входит в комплект ОРРО А31?\n\n*'
   '  - Чехол, стандартная зарядка, пленка, документация\n\n'

'✅*Зачем нужен 2 Мп сенсор глубины в ОРРО А31?\n\n*'
   '  - Чтобы получить реалистичный эффект Боке на портретных снимках\n\n'

)

otvet['A91']              = (

'✅*Отметьте верное расположение камер(сверху вниз) модели OPPO A91:*\n\n'
   '  - 8 мп - Широкоугольный объектив\n'
   '  - 48 мп - Основная камера\n'
   '  - 2 мп - Сенсор глубины\n'
   '  - 2 мп - Портретный объектив\n\n'

'✅*Отметьте ключевые преимущества модели OPPO A91\n'
   '(несколько верных ответов)*\n\n'
   '  - Тонкий и стильный\n'
   '  - Основная камера с четырьмя модулями\n'
   '  - Быстрая зарядка VOOC 3.0\n\n'

'✅*Отметьте верные характеристики процессора модели OPPO A91*\n\n'
   '  - MediaTek Helio P70 8 ядер, 2.1ГГц\n\n'

'✅*Модель OPPO A91 представленна в цветах:*\n\n'
   '  - Черный и синий\n\n'

)

otvet['Reno2 Z']          = (

'✅*Отметьте верное расположение камер на модели Reno2 Z (сверху вниз)*\n\n'
   '  -Широкоугольный модуль 8 МП - Основной модуль 48 МП -  Портретный объектив 2 МП - монообъектив 2 МП\n\n'

'✅*Надежную работу фронтальной камеры модели Reno2 Z и Renо 2 обеспечивает:*\n\n'
   '  -Механизм защиты от падения: при падении камера автоматически скрывается\n\n'

'✅*Емкость аккумулятора модели Reno2 Z?*\n\n'
   '  -4000 мАч\n\n'

'✅*Отметьте преимущества модели Reno2 Z перед моделью Samsung Galaxy A71*\n\n'
   '  -Больше объем оперативной памяти у модели Reno2 Z\n'
   '  -Скрытая фронтальная камера только у модели Reno2 Z,\n'
   '  -Наличие режима Ultra Dark только у модели Reno2 Z\n\n'

'✅*Отметьте преимущества модели Reno2 Z перед моделью Honor 20 Pro*\n\n'
   '  -Скрытая фронтальная камера только у модели Reno2 Z\n'
   '  -Наличие режима Ultra Dark только у модели Reno2 Z\n\n'

'✅*Отметьте основные отличия модели Reno2 и Reno2 Z\n'
'(несколько верных ответов)*\n\n'
   '  -Модификация процессора,\n'
   '  -Объем встроенной памяти\n\n'
                             )
otvet['Reno2']            =(

'✅*Каким образом клиент может активировать режим Ultra Макро в модели Reno2?*\n\n'
   '  -Режим Фото - включить широкий угол - поднести предмет к объективу на расстояние до 2,5 см\n\n'

'✅*Отметьте верное расположение модулей основной камеры модели Reno2 (сверху вниз)*\n\n'
   '  -Основная камера 48 МП - Широкоугольный объектив 8 МП - Телеобъектив 13 МП - Монообъектив 2 МП\n\n'

'✅*Какой угол обзора предусмотрен на сверхширокоугольной камере модели Reno2?*\n\n'
   '  -116 градусов\n\n'

'✅*Как работает Гибридный Зум на модели Reno2?*\n\n'
   '  -При помощи переключения между модулями камеры c разными фокусными расстояниями\n\n'

'✅*Отметьте особенности режима Видео для модели Reno2: \n(несколько вариантов ответа)*\n\n'
   '  -Эффект Боке для видео на основной и фронтальной камере,\n'
   '  -Оптическая и электронная стабилизация для видео без колебаний\n\n'

'✅*Надежную работу фронтальной камеры модели Reno2 Z и Renо 2 обеспечивает:*\n\n'
   '  -Механизм защиты от падения: при падении камера автоматически скрывается\n\n'

'✅*Какой зум предусмотрен в модели Reno2?\n'
'(два верных ответа)*\n\n'
   '  -Максимальный 20ти кратный цифровой\n'
   '  -5ти кратный гибридный\n\n'

'✅*Отметьте основные отличия модели Reno2 и Reno2 Z\n'
'(несколько верных ответов)*\n\n'
   '  -Модификация процессора,\n'
   '  -Объем встроенной памяти\n\n'
'✅*Какая версия ColorOS установлена на модели Reno2?*\n\n'
   '  -6,1\n\n'
                            )
otvet['Reno3']            = (




'✅*Какова толщина и вес смартфона OPPO Reno3?\n\n*'
   '  - 7.9мм, 170г\n\n'

'✅*Что входит в комплект поставки смартфонов OPPO Reno3 и OPPO Reno3 Pro?\n\n*'
   '  - Чехол, пленка, наушники, быстрая зарядка\n\n'

'✅*Какое максимальное количество отпечатков может зарегистрировать клиент на модели Reno3?*\n\n'
   '  -5\n\n'

'✅*Каким образом клиент может активировать Упрощенный режим на модели OPPO Reno3? (ColorOS 7)*\n\n'
   '  -Настройки –  Обложки начального экрана и экрана блокировки – Режим начального экрана – Упрощенный режим\n\n'

'✅*Каково разрешение фронтальной камеры смартфонов ОРРО Reno3 и Reno3 Pro?\n\n*'
   '  - 48 Мп OPPO Reno3 и 32 Мп OPPO Reno3 Pro\n\n'

'✅*Какой процессор установлен в смартфоне ОРРО Reno3?\n\n*'
   '  - MTK P90\n\n'

'✅*Какова частота обновления экрана у смартфонов OPPO Reno3 и OPPO Reno3 Pro?\n\n*'
   '  - 60Гц OPPO Reno3 и 90Гц OPPO Reno3 Pro\n\n'

'✅*Какой объем основной и оператиной памяти установлен в смартфоне ОРРО Reno3?\n\n*'
   '  - 8Гб + 128ГБ\n\n'

'✅*Какой слот расширения установлен в смартфоне ОРРО Reno3?\n\n*'
   '  - 2 SIM + ката памяти\n\n'

'✅*Перечислите модули основной камеры, установленные в смартфоне OPPO Reno3?\n\n*'
   '  - 48Мп + 8Мп + 13Мп + 2Мп\n\n'



                             )

otvet['Reno3 Pro']         = (




'✅*Какова толщина и вес смартфона OPPO Reno3 Pro?\n\n*'
   '  - 7.7мм, 171г\n\n'

'✅*Для каких модулей камеры в смартфоне ОРРО Reno3 Pro установлена \nсистема оптической стабилизации изображения?\n\n*'
   '  - Для основного объектива\n\n'

'✅*Что входит в комплект поставки смартфонов OPPO Reno3 и OPPO Reno3 Pro?\n\n*'
   '  - Чехол, пленка, наушники, быстрая зарядка\n\n'


'✅*Перечислите модули основной камеры, установленные в смартфоне OPPO Reno3 Pro?\n\n*'
   '  - 48Мп + 13Мп + 8Мп + 2Мп\n\n'

'✅*При каких настройках разрешения экрана на смартфоне \n ОРРО Reno3 Pro доступна частота обновления экрана 90Гц?\n\n*'
   '  - При любых\n\n'

'✅*Какой слот расширения установлен в смартфоне ОРРО Reno3 Pro?\n\n*'
   '  - 2 SIM\n\n'

'✅*Каково разрешение фронтальной камеры смартфонов ОРРО Reno3 и Reno3 Pro?\n\n*'
   '  - 48 Мп OPPO Reno3 и 32 Мп OPPO Reno3 Pro\n\n'

'✅*Какой процессор установлен в смартфоне ОРРО Reno3 Pro?\n\n*'
   '  - Qualcomm S765G\n\n'

'✅*Где установлен сканер отпечатка пальца в смартфоне OPPO Reno3 Pro?\n\n*'
   '  - Под экраном\n\n'

'✅*Какова частота обновления экрана у смартфонов OPPO Reno3 и OPPO Reno3 Pro?\n\n*'
   '  - 60Гц OPPO Reno3 и 90Гц OPPO Reno3 Pro\n\n'

'✅*Какой объем основной и оперативной памяти установлен в смартфоне ОРРО Reno3 Pro?\n\n*'
   '  - 12Гб + 256ГБ\n\n'


)

otvet['Find X2']           = (

'✅*Отметьте основные основные особенности экрана OPPO Find X2 \n(несколько верных ответов)\n\n*'
   '  - "Частота обновления экрана 120 Гц,\n'
   '  - Глубина цвета 10 бит,\n'
   '  - Графический сопроцесоор для плавных видео и насыщенных цветов,\n'
   '  - Официальная поддержка HDR10+"\n\n'

'✅*Выберите верные характеристики кинообъектива, \n установленного в смартфоне ОРРО Find X2?\n\n*'
   '  - 12 Мп IMX708, 120° угол захвата, 16:9 соотношение сторон кадра\n\n'

'✅*Какова диагональ и разрешение экрана смартфона OPPO Find X2?\n\n*'
   '  - 6.7" QuadHD+\n\n'

)

otvet['📸Камера']          = (

'✅*Каким образом активируется режим Ulta Night?\n\n*'
   '  -Автоматически активируется в режиме "Фото" при освещении менее 5 lux\n\n'
   
'✅*Отметьте основные особенности режима Ultra Dark \n(несколько вариантов ответа)*\n\n'
   '  -Автоматически активируется в режиме Ночь при освещении менее 5 lux,\n'
   '  -Позволяет сделать фото в условиях, когда освещения недостаточно даже для глаза\n\n'

'✅*Каким образом клиент может сделать снимок на фронтальную камеру?\n'
'Несколько верных ответов*\n\n'
   '  -При помощи кнопки ""Фото""\n'
   '  -При помощи кнопки увеличения/уменьшения громкости,\n'
   '  -При помощи жеста (показать ладонь в камеру)\n\n'

'✅*Каким образом активируется режим Ulta Night?*\n\n'
   '  -Автоматически активируется в режиме "Фото" при освещении менее 5 lux\n\n'
'✅*Каким образом клиент может сделать снимок на фронтальную камеру?\n'
'Несколько верных ответов*\n\n'
   '  -При помощи кнопки ""Фото""\n'
   '  -При помощи кнопки увеличения/уменьшения громкости,\n'
   '  -При помощи жеста (показать ладонь в камеру)\n\n'
'✅*Отметьте основные особенности режима Ultra Dark \n(несколько вариантов ответа)*\n\n'
   '  -Автоматически активируется в режиме Ночь при освещении менее 5 lux,\n'
   '  -Позволяет сделать фото в условиях, когда освещения недостаточно даже для глаза\n\n'
                             )
otvet['⚙️Настройки']     = (


'✅*Каким образом клиент может активировать Sunlight экран\n\n*'
   '  - Технология Sunlight не трубет активации и включает режим повышенной \nяркости на солнце и режим защиты глаз в темноте\n\n'

'✅*Каким образом клиент может активировать режим разделенного экрана?\n\n*'
   '  - Настройки - Разделение экрана\n\n'


'✅*Каким образом клиент может узнать IMEI устройства?\n'
'(Несколько верных ответов)\n\n*'
   '  -Набрать команду \*#06# на телефоне,\n'
   '  -Посмотреть IMEI на коробке от смартфона или в гарантийном талоне,\n'
   '  -Перейти в [Настройки]; [О телефоне]; [Статус]\n\n'

'✅*Каким образом активируется режим Ulta Night?\n\n*'
   '  -Автоматически активируется в режиме "Фото" при освещении менее 5 lux\n\n'

'✅*Каким образом клиент может активировать Sunlight экран*\n\n'
   '  -Технология Sunlight не трубет активации и включает режим повышенной яркости на солнце и режим защиты глаз в темноте\n\n'

'✅*Отметьте основные особенности режима Ultra Dark \n(несколько вариантов ответа)*\n\n'
   '  -Автоматически активируется в режиме Ночь при освещении менее 5 lux,\n'
   '  -Позволяет сделать фото в условиях, когда освещения недостаточно даже для глаза\n\n'

'✅*Преимущества экранного сканера отпечатка 3.0: \n(несколько верных ответов)*\n\n'
   '  -Повышена скорость распознавания за счет большей площади освещения пальца,\n'
   '  -Удобство при снятии блокировки: можно не поднимать смартфон со стола,\n'
   '  -Скорость срабатывания на неактивном экране - 0,32 сек, на активном - 0,28 сек\n\n'

'✅*Режим Game Space 2.0 (Игры) позволяет:\n'
'(несколько верных ответов)*\n\n'
   '  -Оптимизировать уведомления во время игры,'
   '  -Выбрать режим игры на минимальных, средних или максимальных настройках,\n'
   '  -Перераспределить ресурсы системы для комфортного геймплея в зависимости от выбранных настроек\n\n'

'✅*Каким образом клиент может активировать Режим пониженного мерцания и защиты глаз?*\n\n'
   '  -Настройки - Экран и яркость - Без мерцания при низкой яркости для защиты глаз\n\n'

'✅*Каким образом клиент может отключить полноэкранный режим?\n'
'(отключить отображение выреза)*\n\n'
   '  -Настройки - Экран и яркость - Полноэкранный режим\n\n'

'✅*Клиент может деактивировать распознавание лица с закрытыми глазами*\n\n'
   '  -Верно\n\n'

'✅*С помощью какой функции клиент может использовать одно приложение с двух аккаунтов на одном устройстве?*\n\n'
   '  -Клонирование приложений\n\n'

'✅*Каким образом клиент может сделать снимок на фронтальную камеру?\n'
'Несколько верных ответов*\n\n'
   '  -При помощи кнопки ""Фото""\n'
   '  -При помощи кнопки увеличения/уменьшения громкости,\n'
   '  -При помощи жеста (показать ладонь в камеру)\n\n'

'✅*Какие функции включает режим "Умное вождение"?\n'
'Несколько верных ответов*\n\n'
   '  -Разрешает звонки только от выбранных контактов,'
   '  -Блокирует всплывающие уведомления\n\n'


'✅*Каким образом клиент может перенести данные с предыдущего устройства другого Бренда (Android) на смартфон OPPO?*\n\n'
   '  -Установить через Play Market приложение OPPO Clone Phone на предыдущем устройстве -'
   ' Активировать приложение Копия Телефона на OPPO -'
   ' Следовать инструкциям в приложении\n\n'

'✅*Каким образом клиент может выбрать нужный формат звучания Dolby Atmos?*\n\n'
   '  -Настройки - Звуки и вибрация - Dolby Atmos\n\n'

                             )

otvet['Зарядка VOOC']      = (


'✅*Какие преимущества дает клиенту технология VOOC 3.0 по сравнению с версией VOOC 2.0?\n\n*'
   '  - Увеличивается скорость заряда с 90 до 100 процентов\n\n'


'✅*Выберите верные характеристики быстрой зарядки VOOC 4.0?\n\n*'
   '  - 50% за 20 минут и 100% за 56 минут\n\n'

'✅*Выберите верные характеристики быстрой зарядки VOOC 3.0?\n\n*'
   '  - 50% за 30 минут и 100% за 72 минут\n\n'


)

otvet['ColorOS 7️⃣']        = (

'✅*Каким образом клиент может активировать Живые обои (ColorOS 7)*\n\n'
   '  -Настройки – Обложки начального экрана и экрана блокировки – Выбрать обои\n\n'

'✅*Каким образом клиент может кастомизировать иконки (ColorOS 7)?*\n\n'
   '  -Настройки – Обложки начального экрана и экрана блокировки – Задать стиль значка\n\n'

'✅*В чем преимущества использования Режима Затемнения (ColorOS 7)?*\n\n'
   '  -Снижается энергопотребление до 38% при высокой контрастности\n\n'

'✅*Каким образом клиент может активировать Режим Затемнения? (ColorOS 7)*\n\n'
   '  -Настройки- Экран и Яркость – Режим затемнения\n\n'

'✅*Каким образом пользователь может сделать скриншот части экрана (ColorOS 7)?*\n\n'
   '  -Нажать тремя пальцами на экран и удерживать в течение нескольких секунд, выбрать нужную часть изображения\n\n'

'✅*Для чего клиенту может понадобиться Режим Фокусировки? (ColorOS 7)*\n\n'
   '  -Для ограничения использования устройства, например, во время учебы или работы\n\n'

'✅*Каким образом клиент может активировать Режим Фокусировки? (ColorOS 7)*\n\n'
   '  -Выпадающее меню (быстрый доступ к настройкам, панель уведомлений) - Режим Фокусировки\n\n'

)

otvet['🔩Железо']           = (

'✅*Отметьте преимущества памяти типа LPDDR4X.\n'
'Несколько верных ответов\n\n*'
   '  -Плавный интерфейс, быстрая съемка, стабильный fps в играх\n'
   '  -Высокая энегоэффективность\n'
   '  -Высокая скорость работы\n\n'
                             )
otvet['📖История']          = (


'✅*Бренд OPPO входит в ___ Брендов по продаже смартфонов и занимает ___ место в Китае по объемам продаж (по итогам 2018 года)*\n\n'
   '  -ТОП 5, 2е\n\n'


'✅*Бренд OPPO производит СМАРТФОНЫ с ___ года*\n\n'
   '  -2011\n\n'

'✅*OPPO является лидером по продажам в таких странах как:*\n\n'
   '  -Тайланд, Пакистан, Китай\n\n'

'✅*Бренд OPPO присутствует в странах Европы\n'
'(несколько вариантов ответа)*\n\n'
   '  -Нидерланды и Великобритания,\n'
   '  -Испания и Италия,\n'
   '  -Польша и Турция,\n'
   '  -Франция\n\n'


'✅*Бренд OPPO представлен на рынке (с момента регистрации) более ___ лет*\n\n'
   '  -19\n\n'


'✅*В каких странах компания OPPO открыла представительства?\n'
'(Несколько вариантов ответа)*\n\n'
   '  -Польша,\n'
   '  -Турция,\n'
   '  -Великобритания\n\n'

'✅*Производить совершенные технологии для выдающихся людей - это ..*\n\n'
   '  -Миссия Компании\n\n'

'✅*Отметьте копании-партнеры OPPO*\n\n'
   '  -Lamborgini,\n'
   '  -Barcelona,\n'
   '  -Roland-Garros\n\n'

'✅*В каких странах находятся заводы OPPO?*\n\n'
   '  -Китай, \n'
   '  -Алжир, \n'
   '  -Индонезия,\n' 
   '  -Индия\n\n'

'✅*Бренд OPPO в 2004 году выпустил на рынок Европы и США*\n\n'
   '  -Blue-ray плееры\n\n'
                             )

otvet['Производство']      = (

'✅*В каких странах находятся заводы OPPO?*\n\n'
   '  -Китай, \n'
   '  -Алжир, \n'
   '  -Индонезия,\n' 
   '  -Индия\n\n'

'✅*Бренд OPPO в 2004 году выпустил на рынок Европы и США*\n\n'
   '  -Blue-ray плееры\n\n'


'✅*Бренд OPPO производит СМАРТФОНЫ с ___ года*\n\n'
   '  -2011\n\n'
   
'✅*Производство OPPO включает:*\n\n'
   '  -Собственные НИОКР лаборатории,\n'
   '  -Патентные центры,\n'
   '  -Собственную производственную базу в 5 странах\n\n'

)

otvet['Формулировки']      = (

'✅*Отметьте верные формулировки ценности "Стремимся к совершенству"\n'
'(несколько вариантов ответа)*\n\n'
   '  -Страстно увлечены, работаем с самоотдачей, и с гордостью демонстрируем миру наши уникальные устройства,\n'
   '  -Рассматриваем наш продукт с пристальным вниманием, постоянно улучшаем его, подобно мастерам-ремесленникам,\n'
   '  -Стремимся к глубочайшему пониманию всех проблем, чтобы выпускать достойный продукт,\n'
   '  -Добиваемся наивысшего качества\n\n'


'✅*Отметьте верные формулировки ценности "БЭНФЕН" (несколько вариантов ответа)*\n\n'
   '  -Следуем своему пути, несмотря на внешнее давление. Думаем глубже: анализируем причины принятых решений,\n'
   '  -Мыслим критически: мы знаем, что не всегда можем быть правы, постоянно оцениваем свои идеи и принимаем критику как возможность роста,\n'
   '  -Смело берем на себя ответственность, когда возникают неприятности; предъявляем требования к себе, а не к другим,\n'
   '  -Доводим правое дело до конца, даже если мы не обещали –это больше, чем просто честность\n\n'

'✅*Отметьте верные формулировки ценности "Работаем на результат"\n'
'(несколько вариантов ответа)*\n\n'
   '  -Достигаем большего, разделяя общие ценности. Идем к результату и делаем всё для его достижения,\n'
   '  -Договариваемся заранее и видим конец пути, стоя в его начале. Любые наши шаги – в сторону цели,\n'
   '  -Не ищем оправданий, преодолеваем барьеры и объединяем ресурсы,\n'
   '  -Обращаем внимание на результаты команды. Общие достижения приоритетнее личных\n\n'

'✅*Производить совершенные технологии для выдающихся людей - это ..*\n\n'
   '  -Миссия Компании\n\n'


)

otvet['Пост-продажа']      = (

'✅*Каким образом промоутер может разблокировать витринный образец, заблокированный клиентом?\n'
'(Несколько верных ответов)*\n\n'
   '  -Заранее зарегистрировав смартфон на Гугл-сервисе Find My Device,\n'
   '  -Через Сервисный Центр OPPO (отправка устройства осуществляется магазином)\n\n'
'✅*В каком случае рекомендуется выдавать клиентам памятки "OPPO поддержка"?\n'
'(несколько верных ответов)\n\n*'
   '  -Eсли клиент сомневается в покупке смартфона, опасается, что не сможет получить качественное постпродажное обслуживание\n'
   '  -Если пользователь пришел в магазин с проблемой, связанной с' 
   '  -постпродажным обслуживанием (например, он не знает, как найти информацию об адресе СЦ, о статусе гарантии и т. д.)\n'
   '  -Если во время покупки у клиента возникают вопросы о постпродажном обслуживании (например, об условиях гарантии, о том,' 
   '  -как связаться со службой поддержки, где найти адреса СЦ и т.д.)\n\n'

'✅*Как называется услуга доставки смартфона клиента в сервисный центр?\n\n*'
   '  -Сервис без расстояний\n\n'

'✅*Какими способами можно обратиться в Контактный центр OPPO?\n\n*'
   '  -Email, звонок на Горячую линию (форма на сайте)\n\n'

'✅*Как клиент может узнать адреса и время работы сервисных центров OPPO?*\n\n'
   '  -На сайте oppo.com, звонком в контакт-центр\n\n'


'✅*Клиент воспользовался услугой "Сервис без расстояний", но в сервисном\n'
'центре дефект не подтвердился. За что платит клиент?\n\n*'
   '  -Клиент не платит ни за что\n\n'

'✅*Клиент пришел к вам, сообщая о проблеме со смартфоном OPPO. Вы понимаете, что дело в дефекте \n'
'устройства или поломке, которую вы не можете исправить. Ваши действия:*\n\n'
   '  -Обратиться в КЦ OPPO и сообщить о проблеме\n\n'

'✅*Перечислите преимущества пост-продажного обслуживания OPPO. Несколько верных ответов*\n\n'
   '  -Профессиональная помощь на горячей линии,\n'
   '  -Электронная гарантия,\n'
   '  -Возможность получить сервисное обслуживание, даже если в городе нет сервисного центра,\n'
   '  -Только новые и оригинальные запчасти в ремонте устройств,\n'
   '  -Контроль качества работы горячей линии и сервисных центров\n\n'

'✅*Отметьте верный номер Горячей линии OPPO*\n\n'
   '  -8 800 100 6776\n\n'



'✅*Клиент воспользовался услугой "Сервис без расстояний", но в сервисном центре был выявлен \n'
'не гарантийный дефект. Что в этом случае оплачивает клиент?*\n\n'
   '  -В случае, если клиент согласен на ремонт - ремонт и доставку\n\n'

'✅*Перечислите преимущества использования новых запчастей при ремонте \n(несколько вариантов ответа)*\n\n'
   '  -Высокая надежность,\n'
   '  -Легальные и лицензионные запчасти,\n'
   '  -Утилизация неисправных запчастей в соответствии со стандартом OPPO\n\n'

'✅*В мире считается нормальным процент брака ___, процент брака OPPO составляет ___*\n\n'
   '  -2%, менее 1%\n\n'
                             )
otvet['Гарантия']     =(

'✅*Мировая Гарантия на модели OPPO действует:*\n\n'
   '  -Только для модели Reno10x Zoom и OPPO FindX\n\n'

'✅*Куда/какими способами клиент может сдать смартфон OPPO на гарантийную диагностику и ремонт?*\n\n'
   '  -В магазин, где был куплен телефон/ отнести напрямую в сервисные центры/ воспользоваться услугой доставки в сервисный центр\n\n'


'✅*Каков гарантийный период на смартфоны и аксессуары к смартфонам OPPO с момента продажи?*\n\n'
   '  -Смартфон и батарейка 12 месяцев, аксессуары 6 месяцев\n\n'
   
'✅*Какое преимущество дает клиенту регистрация Электронного гарантийного талона (eWarranty)?*\n\n'
   '  -Гарантийный срок начинается с даты регистрации eWarranty\n\n'
   
'✅*Каким образом происходит регистрация Электронной Гарантии*\n\n'
   '  -При первом выходе в интернет с сим-картой\n\n'

)


import telebot
from telebot import types

img = open('сервицисныйцент1.png', 'rb')
img1 = open('сервицисныйцент2.png', 'rb')
bot = telebot.TeleBot('1149028449:AAGdZczZKD4DPB-Y8Isq5KLMYaSm0ab45As')

@bot.message_handler(commands=['start'])
def start_message(message=True):
    message_start = bot.send_message(message.chat.id, 'Привет. Я помогу тебе 😉 ')
    keyboard0 = types.ReplyKeyboardMarkup(row_width=1, resize_keyboard=True)
    keyboard0.add('🔶Меню🔶')
    bot.send_message(message.chat.id,'*Нажми на "Меню" и выбери нужный раздел * 👌',reply_markup=keyboard0,
                     parse_mode='Markdown')

@bot.message_handler(content_types=['text'])
def start_message0(message=True):
   if message.text == '🔶Меню🔶':
       message_start = bot.send_message(message.chat.id, 'Привет. Я помогу тебе 😉 ')
       keyboard = types.ReplyKeyboardMarkup(row_width=3, resize_keyboard=True, one_time_keyboard=False)
       keyboard.add('🙏Ответы на тесты🙏')
       keyboard.add(('Контакты'))

       bot.send_message(message.chat.id, '🧘‍♂️Выбери тему вопроса, ответ на который ты хочешь узнать : ', reply_markup=keyboard)

   if message.text == '🙏Ответы на тесты🙏':
      keyboard1 = types.ReplyKeyboardMarkup(row_width=3, resize_keyboard=True, one_time_keyboard=False)
      keyboard1.add('⚙️Настройки и OS 7️⃣', '🔩Железо')
      keyboard1.add('📸Камера', '📖История и Формулировки')
      keyboard1.add('🔥Модели телефонов🔥')
      keyboard1.add('🌀VisitBasis', '🔰Постпродажа и Гарантия')
      keyboard1.add('🔶Меню🔶')


      bot.send_message(message.chat.id, '🧘‍♂️Выбери тему вопроса, ответ на который ты хочешь узнать : ', reply_markup=keyboard1)

   if message.text == '⚙️Настройки и OS 7️⃣':
      keyboard_os = types.ReplyKeyboardMarkup(row_width=2, resize_keyboard=True, one_time_keyboard=False)
      keyboard_os.add('⚙️Настройки', 'ColorOS 7️⃣')
      keyboard_os.add('Зарядка VOOC')
      keyboard_os.add('🙏Ответы на тесты🙏')


      bot.send_message(message.chat.id, '🧘‍♂️*Если в вопросе прописан "VOOC" или "ColorOS 7" - смело жмакай одноименную кнопку.\n'
                                        'Там все секреты.*', reply_markup=keyboard_os, parse_mode='Markdown')

   if message.text == '🔥Модели телефонов🔥':
      keyboard2 = types.ReplyKeyboardMarkup(row_width=3, resize_keyboard=True, one_time_keyboard=False)
      keyboard2.add('A1k', 'A5s', 'A31')
      keyboard2.add('A5 2020', 'A9 2020','A91')
      keyboard2.add('Reno2 Z', 'Reno2')
      keyboard2.add('Reno3', 'Reno3 Pro', 'Find X2')
      keyboard2.add('🙏Ответы на тесты🙏')

      bot.send_message(message.chat.id, '*Выбери модель которая указана в вопросе*', reply_markup=keyboard2, parse_mode='Markdown')

   if message.text == '📖История и Формулировки':
      keyboard_history = types.ReplyKeyboardMarkup(row_width=1, resize_keyboard=True, one_time_keyboard=False)
      keyboard_history.add('📖История', 'Производство', 'Формулировки')
      keyboard_history.add('🙏Ответы на тесты🙏')
      bot.send_message(message.chat.id, '🧘‍♂️*Надеюсь найдешь здесь ответ.*',
                       reply_markup=keyboard_history, parse_mode='Markdown')

   if message.text == '🔰Постпродажа и Гарантия':
      keyboard_garanty = types.ReplyKeyboardMarkup(row_width=2, resize_keyboard=True, one_time_keyboard=False)
      keyboard_garanty.add('Пост-продажа', 'Гарантия')
      keyboard_garanty.add('🙏Ответы на тесты🙏')

      bot.send_message(message.chat.id, '🧘‍♂️*Если в вопросе есть слово "Гарантия" - смело жмякай на нее в меню.*',
                       reply_markup= keyboard_garanty, parse_mode='Markdown')

   if message.text == 'Контакты':
      keyboard_contact = types.ReplyKeyboardMarkup(row_width=2,resize_keyboard=True, one_time_keyboard=False)
      keyboard_contact.add('Мск/Авторизированные СЦ')
      keyboard_contact.add('🔶Меню🔶')

      bot.send_message(message.chat.id, 'Куратор вентры (Дарья Сазонова) \n- 7-919-970-36-90 \n'
                     'Тренер проекта Oppo (Артем Мосеев) \n- 7-916-001-57-47 \n\n'
                     '*Если вы встретили вопрос которого \nнет в боте, напишите мне\n'
                     'его так как он указан в тесте. Сделаем его лучше вместе!*\n\n'
                     'Администратор бота (Корноух Петр) \n- 7-999-667-20-18\n\n'
                     'Основной телеграмм OPPO \n- @OPPO\_rus\_bot\n'
                     'Основная группа vk \n- https://vk.com/oppo\_russia\n'
                     'Основной YouTube канал \n- @OppoRussia\n', parse_mode='Markdown', reply_markup=keyboard_contact)

   if message.text == 'Мск/Авторизированные СЦ':
      keyboard_sc = types.ReplyKeyboardMarkup(row_width=2,resize_keyboard=True)
      keyboard_sc.add('🔶Меню🔶')
      bot.send_photo(message.chat.id, img)
      bot.send_photo(message.chat.id, img1)

   if message.text in otvet:
          bot.send_message(message.chat.id, otvet[message.text], parse_mode='Markdown')
   elif message.text in telefon:
          bot.send_message(message.chat.id, telefon[message.text], parse_mode='Markdown')




bot.polling(none_stop=True, interval=0)